package lesson9Dez13;
/*      First level: 1) В первом подъезде квартиры с 1 по 20. Во втором с 21 по 48. В третьем с 49 по 90.
        Пользователь вводит номер квартиры. Программа должна указать в каком подъезде находится данная квартира.
        2) Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1',
        то в переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее.
        Решите задачу через switch-case.
        3) В переменной month лежит какое-то число из интервала от 1 до 12.
        Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).

        Second level: 1)
        Пользователь вводит число от 1 до 9999 (сумму выдачи в банкомате).
        Необходимо вывести на экран словами введенную сумму и в конце написать название валюты с правильным окончанием.
        Например: 7431 – семь тысяч четыреста тридцать один доллар, 2149 – две тысячи сто сорок девять долларов,
        15 – пятнадцать долларов, 3 – три доллара. Для решения этой задачи вам необходимо
        будет применять оператор % (остаток от деления)
        1 доллар
        2 доллара
        3 доллара
        4 доллара
        5 долларов
        6 долларов
        7 долларов
        8 долларов
        9 долларов
        0 долларов
        общий случай смотреть на последнюю цифру числа и исходя из этого писать окончание
        (исключение числа заканчивающиеся на 11-19)
        например 201 доллар 221 доллар, но 211 долларов
*/
public class Homework {
}
