package lesson9Dez13.homework9.SecondLevel;
//1) Пользователь вводит число от 1 до 9999 (сумму выдачи в банкомате).
//   Необходимо вывести на экран словами введенную сумму и в конце написать название валюты с правильным окончанием.
//   Например: 7431 – семь тысяч четыреста тридцать один доллар, 2149 – две тысячи сто сорок девять долларов,
//   15 – пятнадцать долларов, 3 – три доллара. Для решения этой задачи вам необходимо
//   будет применять оператор % (остаток от деления)
//   1 доллар
//   2 доллара
//   3 доллара
//   4 доллара
//   5 долларов
//   6 долларов
//   7 долларов
//   8 долларов
//   9 долларов
//   0 долларов
//   общий случай смотреть на последнюю цифру числа и исходя из этого писать окончание
//   (исключение числа заканчивающиеся на 11-19)
//   например 201 доллар 221 доллар, но 211 долларов
public class Task1 {
    public static void main(String[] args) {

    }
}
