package lesson8Dez08;
//1) С консоли вводится число - возраст человека
//   после чего вызывается метод, который возвращает ответ можно ли этому человеку смотреть фильм, у фильма ограничение
//   по возрасту не меньше 18.
// Пример:
//   на входе число 19 пишется Можно идти смотреть кино
//   на входе число 7 пишется Нельзя идти смотреть кино
//2) напишите программу, которая принимает 1 число - год (можно с помощью Scanner или с помощью Random)
//   и выводит високосный год или нет
//3) Покупатель приходит в магазин печенья, 1 печенье стоит 0.5 евро
//   Напишите программу которая спрашивает у покупателя сколько он хочет купить печенья, после этого с помощью Scanner
//   считывается число сколько печенья хочет купить покупатель, после спрашивается сколько денег у покупателя
//   и считывается число (сколько денег у покупателя), программа должна написать может ли купить столько печенья
//   за такие деньги, например
//   покупатель хочет купить 10 печенек, у него 4 евро ответ  нельзя
//   покупатель хочет купить 12 печенек, у него 8 евро ответ  можно
//4) напишите программу, которая говорит выпал орел или решка
//   true - орел
//   false -решка
//   используйте Random и метод nextBoolean,
public class hwTask1 {
}
