package lesson6Dez01;

import java.util.Scanner;

import static java.lang.String.join;

/*        First level:
        1) Написать программу, которая считывает с консоли (Scanner) строку и выводит на консоль ее длину
        2) Написать метод который будет возвращать результат склейки двух строк. например:
        вызывается метод со строками  "I love " и "Java" после этого метод вернет I love Java
        3) создайте 5 методов с разной сигнатурой, но с одинаковым названием метода
        4) напишите класс с методами для конвертации градусы цельсия в фаренгейты и метод для конвертации фаренгейтов в цельсия
        (Фаренгейт — 32) : 1,8 = Цельсий Пример: (50°F - 32) : 1,8 = 10°C
        Цельсий х 1,8 + 32 = Фаренгейт Пример: 10°C x 1,8 + 32 = 50°F
        5) напишите метод для получения суммы трех чисел
*/
public class Homework {
    public static void main(String[] args) {
       /* Scanner scanner = new Scanner(System.in);
        System.out.println("Выведи длину слова: ");
        String str = scanner.nextLine();
        System.out.println(str.length()); // str.length() =  метод */


    }

}
