package lesson8Dez08.homework;
//Second level:
//        1) пользователь вводит с консоли с помощью сканера 3 числа, после чего находится максимальное число среди
//        этих трех чисел (используйте if/else if /else и операции сравнения)
//        2) Есть устройство, на табло которого показывается количество секунд, оставшихся до конца рабочего дня.
//        Когда рабочий день начинается ровно в 9 часов утра — табло отображает «28800» (т.е. остаётся 8 часов),
//        когда 14:30 — на табло «9000» (т.е. остаётся два с половиной часа), а когда наступает 17 часов — на табло
//        отображается «0» (т.е. рабочий день закончился).
//        Некоторыe сотрудники не умеют оценивать остаток рабочего дня в секундах.
//        Итак: требуется написать программу, которая вместо секунд будет выводить на табло понятные фразы с информацией
//        о том, сколько полных часов осталось до конца рабочего дня.
//        Например: «осталось 7 часов», «осталось 4 часа», «остался 1 час», «осталось менее часа».
//        Обьяснение: в переменную n должно записываться случайное (на время тестирования программы) целое число из
//        диапазона от 0 до 28800, далее оно должно выводиться на экран (для тех, кто понимает в секундах) и на следующей
//        строке (для тех кто не понимает) должна выводиться фраза о количестве полных часов, содержащихся в n секундах.
//        3) в том же городе Б решили доработать систему с пробками и решили усовершенствовать систему проезда в город,
//        теперь в выходные могут заезжать только легковые автомобили с четными номерами, а в будни все грузовые,
//        а так же машины с нечетными номерами. Напишите программу, которая принимает 3 параметра isWeekend, isLorry,
//        carNumber и пишет можно ли заезжать этой машине
//        4) Бонусная задача: допишите программу, чтобы она говорила почему нельзя заезжать этой машине, например
//        в выходной день пыталась заехать грузовая машина, ответ - в выходные грузовым нельзя
public class BonusTask {
}
